shaspitz/orbit-stabilization/PSOC Examples/Lab6Sample.cydsn/codegentemp/ByteCountReset.h
/*******************************************************************************
* File Name: ByteCountReset.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_ByteCountReset_H) /* CY_CONTROL_REG_ByteCountReset_H */
#define CY_CONTROL_REG_ByteCountReset_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} ByteCountReset_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    ByteCountReset_Write(uint8 control) ;
uint8   ByteCountReset_Read(void) ;

void ByteCountReset_SaveConfig(void) ;
void ByteCountReset_RestoreConfig(void) ;
void ByteCountReset_Sleep(void) ; 
void ByteCountReset_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define ByteCountReset_Control        (* (reg8 *) ByteCountReset_Sync_ctrl_reg__CONTROL_REG )
#define ByteCountReset_Control_PTR    (  (reg8 *) ByteCountReset_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_ByteCountReset_H */


/* [] END OF FILE */
